<template>
  <div class="about" dir="rtl" >
    <div class="text-center">
    <v-icon color="primary" size="100">mdi-gamepad-variant-outline</v-icon>
    <h1 class="mb-13 primary--text">my biografy</h1>
    </div>
    <p class="text-right">همه چیز برمیگرده به سال‌ها پیش، وقتی که بچه بودم و تو خونمون دو تا کامپیوتر داشتیم. یکی قدیمی بود و یکی دیگه جدید و ویندوز ۷ داشت، یعنی آخرین ویندوز اون زمان که تازه هم اومده بود. کامپیوتر قدیمی مال من شده بود و کلی ذوق داشتم، بزرگترین هدفم این بود که ویندوز xp رو تبدیل کنم به ویندوز ۷ 😂🤦‍♂️ هی میبردیم که بهش ویندوز بزنن میگفتن ویندوز 7 رو ساپورت نمیکنه. خلاصه اونقدر شب و روزمو باهاش گذرونده بودم که تمام فایل‌های سیستمی رو هم از حفظ بودم.</p>
    <h1 class="primary--text">My first love</h1>
    <p class="text-right"> کمی گذشت و پنجم ششم دبستان میخوندم و معلّمامون لپ تاپ میاوردن کلاس و با اون درس میدادن. عشقی واقعی تر از اون حسی که به لپ تاپ پیدا کردم رو نمیدونم کی و کجا تجربه میکنم ولی به احتمال زیاد هیچوقت! رویای من این شده بود که یک لپ تاپ داشتم 🥺 جایی رسیده بودم که دیگه درس اهمیتی برام نداشت، فقط تو ذهنم این رویا رو داشتم که یه روز کارخونه‌ای تاسیس میکنم که لپ تاپ تولید کنم و با این رویا هر روزمو سپری میکردم. بیچاره مامان بابام، اونقدر با صحبت در مورد لپ‌تاپ و ویندوزها کلافشون کرده بودم که اگه من به جاشون بودم میبردم خودمو میزاشتم پرورشگاه 😂

خلاصه اونقدر اصرار کردم که بلاخره برام یه لپ تاپ خریدن 😍😍 میتونم بگم بهترین روز زندگلیم با اختلاف خیلی زیاد بود! بعد از اینکه صاحب لپ‌تاپ شدم کم کم تفکرات چیپ و نوجوانیم فروکش کرد و سعی کردم بیشتر فکرمو بدم به متخصص شدن تو زمنیه‌های مختلف تکنولوژی. البته نتیجش این شده بود که ویندوز نصب کن فامیل شدم 😐😂😂 اون زمان برنامه نویسی از جمله کارهایی بود که شاید علاقه ای نداشتم بهش و کار خیلی خارق العاده‌ای تو ذهنم بود که از دست من برنمیاد! </p>

<h1 class="primary--text">my character</h1>
    <p class="text-right"> کمی گذشت و پنجم ششم دبستان میخوندم و معلّمامون لپ تاپ میاوردن کلاس و با اون درس میدادن. عشقی واقعی تر از اون حسی که به لپ تاپ پیدا کردم رو نمیدونم کی و کجا تجربه میکنم ولی به احتمال زیاد هیچوقت! رویای من این شده بود که یک لپ تاپ داشتم 🥺 جایی رسیده بودم که دیگه درس اهمیتی برام نداشت، فقط تو ذهنم این رویا رو داشتم که یه روز کارخونه‌ای تاسیس میکنم که لپ تاپ تولید کنم و با این رویا هر روزمو سپری میکردم. بیچاره مامان بابام، اونقدر با صحبت در مورد لپ‌تاپ و ویندوزها کلافشون کرده بودم که اگه من به جاشون بودم میبردم خودمو میزاشتم پرورشگاه 😂

خلاصه اونقدر اصرار کردم که بلاخره برام یه لپ تاپ خریدن 😍😍 میتونم بگم بهترین روز زندگلیم با اختلاف خیلی زیاد بود! بعد از اینکه صاحب لپ‌تاپ شدم کم کم تفکرات چیپ و نوجوانیم فروکش کرد و سعی کردم بیشتر فکرمو بدم به متخصص شدن تو زمنیه‌های مختلف تکنولوژی. البته نتیجش این شده بود که ویندوز نصب کن فامیل شدم 😐😂😂 اون زمان برنامه نویسی از جمله کارهایی بود که شاید علاقه ای نداشتم بهش و کار خیلی خارق العاده‌ای تو ذهنم بود که از دست من برنمیاد! </p>

<h1 class="primary--text">This is an about page</h1>
    <p class="text-right"> کمی گذشت و پنجم ششم دبستان میخوندم و معلّمامون لپ تاپ میاوردن کلاس و با اون درس میدادن. عشقی واقعی تر از اون حسی که به لپ تاپ پیدا کردم رو نمیدونم کی و کجا تجربه میکنم ولی به احتمال زیاد هیچوقت! رویای من این شده بود که یک لپ تاپ داشتم 🥺 جایی رسیده بودم که دیگه درس اهمیتی برام نداشت، فقط تو ذهنم این رویا رو داشتم که یه روز کارخونه‌ای تاسیس میکنم که لپ تاپ تولید کنم و با این رویا هر روزمو سپری میکردم. بیچاره مامان بابام، اونقدر با صحبت در مورد لپ‌تاپ و ویندوزها کلافشون کرده بودم که اگه من به جاشون بودم میبردم خودمو میزاشتم پرورشگاه 😂

خلاصه اونقدر اصرار کردم که بلاخره برام یه لپ تاپ خریدن 😍😍 میتونم بگم بهترین روز زندگلیم با اختلاف خیلی زیاد بود! بعد از اینکه صاحب لپ‌تاپ شدم کم کم تفکرات چیپ و نوجوانیم فروکش کرد و سعی کردم بیشتر فکرمو بدم به متخصص شدن تو زمنیه‌های مختلف تکنولوژی. البته نتیجش این شده بود که ویندوز نصب کن فامیل شدم 😐😂😂 اون زمان برنامه نویسی از جمله کارهایی بود که شاید علاقه ای نداشتم بهش و کار خیلی خارق العاده‌ای تو ذهنم بود که از دست من برنمیاد! </p>


  </div>
  
</template>
<script>

export default {
  name:"About",
  metaInfo: {
        title: 'About Us | درباه من'
    },
}
</script>

<style lang="scss">
@media screen and (max-width: 512px){
  .about{
    margin-top:70px;
  }
}
</style>